mdmfile/src/BusinessProcesses/мдмПроцессОбработки/мдмПроцессОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>мдмПроцессОбработки</name>
  <task>Task.мдмЗадачаОбработки</task>
  <attributes>
    <name>БизнесПроцесс</name>
    <type>
      <types>CatalogRef.мдмБизнесПроцессы</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Прерван</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DefinedType.мдмМастерДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:BusinessProcess>

mdmfile/src/Catalogs/мдмТочкиВложенныйПроцесс/мдмТочкиВложенныйПроцесс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмТочкиВложенныйПроцесс</name>
  <owners>Catalog.мдмБизнесПроцессы</owners>
  <attributes>
    <name>БизнесПроцесс</name>
    <type>
      <types>CatalogRef.мдмБизнесПроцессы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередСозданиемЗадач</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриСозданииЗадачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередСозданиемБизнесПроцесса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриСозданииБизнесПроцесса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередВыполнением</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриВыполнении</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбъекта</name>
    <type>
      <types>CatalogRef.мдмФормыДанных</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Входы</name>
    <attributes>
      <name>Точка</name>
      <type>
        <types>DefinedType.мдмТочкаБизнесПроцесса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Выходы</name>
    <attributes>
      <name>Точка</name>
      <type>
        <types>DefinedType.мдмТочкаБизнесПроцесса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

mdmfile/src/BusinessProcesses/мдмПроцессОбработки/Forms/КартаМаршрута/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПроцессОбработки", ПроцессОбработки);
	
	Заголовок = "Карта маршрута " + ПроцессОбработки;
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	Карта = ПроцессОбработки.ПолучитьОбъект().ПолучитьКартуБизнесПроцесса();
	
КонецПроцедуры

&НаКлиенте
Процедура КартаВыбор(Элемент)
	
	ОбъектыЭлементаСхемы = ОбъектыЭлементаСхемы(Элемент.ТекущийЭлемент.Имя, ПроцессОбработки);	
	
	Если ОбъектыЭлементаСхемы.Количество() = 1 тогда	
		
		ПоказатьЗначение(, ОбъектыЭлементаСхемы[0]);
		
	ИначеЕсли ОбъектыЭлементаСхемы.Количество() > 1 тогда		
		
		Отбор = Новый Структура;
		Отбор.Вставить("Ссылка", ОбъектыЭлементаСхемы);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Отбор);
		
		ОткрытьФорму("Задача.мдмЗадачаОбработки.Форма.ФормаСписка", 
			ПараметрыФормы, 
			ЭтотОбъект,,,,, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбъектыЭлементаСхемы(Имя, ПроцессОбработки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаОбработки.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.мдмЗадачаОбработки КАК ЗадачаОбработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.мдмТочкиДействие КАК ТочкиДействие
		|		ПО ЗадачаОбработки.ТочкаБизнесПроцесса = ТочкиДействие.Ссылка
		|ГДЕ
		|	ТочкиДействие.Имя = &Имя
		|	И ТочкиДействие.Владелец = &БизнесПроцесс
		|	И ЗадачаОбработки.БизнесПроцесс = &ПроцессОбработки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПроцессОбработки.Ссылка
		|ИЗ
		|	Задача.мдмЗадачаОбработки КАК ЗадачаОбработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.мдмТочкиВложенныйПроцесс КАК ТочкиВложенныйПроцесс
		|		ПО ЗадачаОбработки.ТочкаБизнесПроцесса = ТочкиВложенныйПроцесс.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.мдмПроцессОбработки КАК ПроцессОбработки
		|		ПО ЗадачаОбработки.БизнесПроцесс = ПроцессОбработки.Ссылка
		|ГДЕ
		|	ТочкиВложенныйПроцесс.Имя = &Имя
		|	И ТочкиВложенныйПроцесс.Владелец = &БизнесПроцесс
		|	И ЗадачаОбработки.БизнесПроцесс = &ПроцессОбработки";
	
	Запрос.УстановитьПараметр("ПроцессОбработки", ПроцессОбработки);
	Запрос.УстановитьПараметр("БизнесПроцесс", ПроцессОбработки.БизнесПроцесс);
	Запрос.УстановитьПараметр("Имя", Имя);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции
